<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 使用复合缓存类型
    'type' => 'complex',
    // 默认使用的缓存
    'default' => [
        // 驱动方式
        'type' => 'file',
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
        // 缓存保存目录
        'path'   => '',
    ],
    'file' => [
        // 驱动方式
        'type' => 'file',
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
        // 缓存保存目录
        'path'   => '',
    ],
    // redis缓存
    'redis' => [
        // 驱动方式
        'type' => 'redis',
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
        // 服务器地址
        'host' => env('redis.host', 'redis'),
        'port' => env('redis.port', 6379),
        'password' => env('redis.password', ''),
        'select' => 0,
    ],
];
